fonecmid-diplom/src/Documents/ВМК_ГрафикОтпусков/ВМК_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВМК_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ГрафикОтпусков</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВМК_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/ВМК_Отпуска/ВМК_Отпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВМК_Отпуска</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВМК_ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОтпуска</name>
    <type>
      <types>EnumRef.ВМК_ВидОтпуска</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/Enums/ВМК_ВидОтпуска/ВМК_ВидОтпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВМК_ВидОтпуска</name>
  <enumValues>
    <name>План</name>
  </enumValues>
  <enumValues>
    <name>Факт</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/ВМК_ГрафикОтпусков/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Для Каждого Строка из ГрафикОтпусков Цикл
		
		КоличествоДней = (НачалоДня(Строка.ДатаОкончания) - НачалоДня(Строка.ДатаНачала))/ (60 * 60 * 24);
		
		МенеджерЗаписи = РегистрыСведений.ВМК_Отпуска.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = Год;
		МенеджерЗаписи.Сотрудник = Строка.Сотрудник;
		МенеджерЗаписи.ВидОтпуска = Перечисления.ВМК_ВидОтпуска.План;
		МенеджерЗаписи.КоличествоДней = КоличествоДней;
		МенеджерЗаписи.ДатаНачала = Строка.ДатаНачала;
		МенеджерЗаписи.ДатаОкончания = Строка.ДатаОкончания;
		МенеджерЗаписи.Записать();
			
	КонецЦикла;
	
КонецПроцедуры
